Revit 2024 API
FamilySymbol.SetStructuralSection Method
 Sets the structural section in element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void SetStructuralSection(
	StructuralSection structuralSection
)
Visual Basic
Public Sub SetStructuralSection ( _
	structuralSection As StructuralSection _
)
Visual C++
public:
void SetStructuralSection(
	StructuralSection^ structuralSection
)
Parameters
structuralSection
Type: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Structural section with values that will be set.
Remarks
 Only beams, braces and structural columns can have a structural section. To check if the element can have structural section use the [!:Family.HasStructuralSection()] method.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This FamilySymbol cannot have a structural section.
See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace